In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"Name": ["Anthony, Mr. Stark", "Bruce, Dr. Benner", "Wanda, Miss. Maximoff",
                            "Clint, Mr. Burton,", "Stephen, Mr. Rogers", "Natasha, Miss. Romanoff",
                            "Stephen, Dr. Strange", "Peter, Mr. Parker", "Peter, Mr. Quill"],
                   "Age": [45, 42, 25, 35, 120, 34, 40, 18, 38],
                   "Gender": ["male", "male", "female", "male", "male", "female", "male", "male", "male"]}
                  )

In [3]:
df

                      Name  Age  Gender
0       Anthony, Mr. Stark   45    male
1        Bruce, Dr. Benner   42    male
2    Wanda, Miss. Maximoff   25  female
3       Clint, Mr. Burton,   35    male
4      Stephen, Mr. Rogers  120    male
5  Natasha, Miss. Romanoff   34  female
6     Stephen, Dr. Strange   40    male
7        Peter, Mr. Parker   18    male
8         Peter, Mr. Quill   38    male

In [4]:
df.head()

                    Name  Age  Gender
0     Anthony, Mr. Stark   45    male
1      Bruce, Dr. Benner   42    male
2  Wanda, Miss. Maximoff   25  female
3     Clint, Mr. Burton,   35    male
4    Stephen, Mr. Rogers  120    male

In [5]:
df.tail()

                      Name  Age  Gender
4      Stephen, Mr. Rogers  120    male
5  Natasha, Miss. Romanoff   34  female
6     Stephen, Dr. Strange   40    male
7        Peter, Mr. Parker   18    male
8         Peter, Mr. Quill   38    male

In [6]:
import numpy as np

In [7]:
df["Name"]

0         Anthony, Mr. Stark
1          Bruce, Dr. Benner
2      Wanda, Miss. Maximoff
3         Clint, Mr. Burton,
4        Stephen, Mr. Rogers
5    Natasha, Miss. Romanoff
6       Stephen, Dr. Strange
7          Peter, Mr. Parker
8           Peter, Mr. Quill
Name: Name, dtype: object

In [8]:
df["Age"]

0     45
1     42
2     25
3     35
4    120
5     34
6     40
7     18
8     38
Name: Age, dtype: int64

In [9]:
ages = df["Age"]

In [10]:
ages

0     45
1     42
2     25
3     35
4    120
5     34
6     40
7     18
8     38
Name: Age, dtype: int64

In [12]:
list(range(1,10,2))

[1, 3, 5, 7, 9]

In [13]:
lista = [12, 15, 42, 14, 66, 18, 23, 50]

In [14]:
lista

[12, 15, 42, 14, 66, 18, 23, 50]

In [15]:
lista[0]

12

In [16]:
lista[0:3]

[12, 15, 42]

In [23]:
ages.get(1)

42

In [24]:
ages[3:6]

3     35
4    120
5     34
Name: Age, dtype: int64

In [29]:
type(lista)

list

In [30]:
type(ages)

pandas.core.series.Series

In [34]:
df.iloc[5:8, 0:3]

                      Name  Age  Gender
5  Natasha, Miss. Romanoff   34  female
6     Stephen, Dr. Strange   40    male
7        Peter, Mr. Parker   18    male

In [37]:
df[5:8][["Name", "Age"]]

                      Name  Age
5  Natasha, Miss. Romanoff   34
6     Stephen, Dr. Strange   40
7        Peter, Mr. Parker   18

In [42]:
dates = pd.date_range('2018/01/01', periods=6, freq='D')
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [43]:
list('ABCD')

['A', 'B', 'C', 'D']

In [54]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-01-01  0.747937 -0.328483  0.976128 -0.784472
2018-01-02  0.222871  0.588562 -1.068051  1.293000
2018-01-03  1.277950 -0.410864  0.956295 -0.953034
2018-01-04  0.562868  1.451423 -0.085136  0.513686
2018-01-05 -1.824900  0.620189  0.017154 -1.113871
2018-01-06 -0.236903 -0.109534 -1.124142  0.479977

In [59]:
df[['C']]

                   C
2018-01-01  0.976128
2018-01-02 -1.068051
2018-01-03  0.956295
2018-01-04 -0.085136
2018-01-05  0.017154
2018-01-06 -1.124142

In [69]:
df[['C', 'D']][:4]

                   C         D
2018-01-01  0.976128 -0.784472
2018-01-02 -1.068051  1.293000
2018-01-03  0.956295 -0.953034
2018-01-04 -0.085136  0.513686

In [70]:
df[df > 0]

                   A         B         C         D
2018-01-01  0.747937       NaN  0.976128       NaN
2018-01-02  0.222871  0.588562       NaN  1.293000
2018-01-03  1.277950       NaN  0.956295       NaN
2018-01-04  0.562868  1.451423       NaN  0.513686
2018-01-05       NaN  0.620189  0.017154       NaN
2018-01-06       NaN       NaN       NaN  0.479977

In [71]:
df1 = df[df > 0]

In [72]:
df1

                   A         B         C         D
2018-01-01  0.747937       NaN  0.976128       NaN
2018-01-02  0.222871  0.588562       NaN  1.293000
2018-01-03  1.277950       NaN  0.956295       NaN
2018-01-04  0.562868  1.451423       NaN  0.513686
2018-01-05       NaN  0.620189  0.017154       NaN
2018-01-06       NaN       NaN       NaN  0.479977

In [73]:
df2 = df1.dropna()

In [74]:
df2

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [77]:
df3 = df1.dropna(how = 'all')
df3

                   A         B         C         D
2018-01-01  0.747937       NaN  0.976128       NaN
2018-01-02  0.222871  0.588562       NaN  1.293000
2018-01-03  1.277950       NaN  0.956295       NaN
2018-01-04  0.562868  1.451423       NaN  0.513686
2018-01-05       NaN  0.620189  0.017154       NaN
2018-01-06       NaN       NaN       NaN  0.479977

In [81]:
df3.fillna(method = 'ffill')

                   A         B         C         D
2018-01-01  0.747937       NaN  0.976128       NaN
2018-01-02  0.222871  0.588562  0.976128  1.293000
2018-01-03  1.277950  0.588562  0.956295  1.293000
2018-01-04  0.562868  1.451423  0.956295  0.513686
2018-01-05  0.562868  0.620189  0.017154  0.513686
2018-01-06  0.562868  0.620189  0.017154  0.479977

In [85]:
df3.fillna(method = 'backfill')

                   A         B         C         D
2018-01-01  0.747937  0.588562  0.976128  1.293000
2018-01-02  0.222871  0.588562  0.956295  1.293000
2018-01-03  1.277950  1.451423  0.956295  0.513686
2018-01-04  0.562868  1.451423  0.017154  0.513686
2018-01-05       NaN  0.620189  0.017154  0.479977
2018-01-06       NaN       NaN       NaN  0.479977

In [87]:
df3.fillna(0)

                   A         B         C         D
2018-01-01  0.747937  0.000000  0.976128  0.000000
2018-01-02  0.222871  0.588562  0.000000  1.293000
2018-01-03  1.277950  0.000000  0.956295  0.000000
2018-01-04  0.562868  1.451423  0.000000  0.513686
2018-01-05  0.000000  0.620189  0.017154  0.000000
2018-01-06  0.000000  0.000000  0.000000  0.479977

In [88]:
df1.interpolate(method = 'linear')

                   A         B         C         D
2018-01-01  0.747937       NaN  0.976128       NaN
2018-01-02  0.222871  0.588562  0.966211  1.293000
2018-01-03  1.277950  1.019992  0.956295  0.903343
2018-01-04  0.562868  1.451423  0.486724  0.513686
2018-01-05  0.562868  0.620189  0.017154  0.496832
2018-01-06  0.562868  0.620189  0.017154  0.479977